{
    "courses": [
        {
            "id": "101",
            "courseName": "Learn Python 3",
            "type": "Beginner",
            "lessons": "10",
            "duration": "1 hour 40 minutes",
            "instructor": "Philliph Joe",
            "category_id": "1",
            "skills": ["Write Python 3 programs", "Simplify the code you write", "Take your skills off-platform"],
            "description": "If you're looking for a programming language that's flexible and easy to read, try learning Python. It's one of the most popular languages today, and programming in Python is used for everything from web and software development to data science and analytics to quality assurance.",
            "image": "https://1.bp.blogspot.com/-VpuXMJ-UI48/YAZt9BTjEgI/AAAAAAAAE5s/fdortrB6SuQczOcpTkuyNHDSdmbjQMxfACLcBGAsYHQ/s16000/Introduction%2Bto%2BPython.jpg"
        },
        {
            "id": "102",
            "courseName": "Deep Learning",
            "type": "Advance",
            "lessons": "36",
            "duration": "27 hours",
            "instructor": "John Doe",
            "category_id": "4",
            "skills": ["Build and train deep neural networks", "Train test sets, analyze variance for DL applications", "Build a CNN and apply it to detection and recognition tasks", "Build and train RNNs, work with NLP and Word Embeddings"],
            "description": "The Deep Learning Specialization is a foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. AI is transforming many industries. The Deep Learning Specialization provides a pathway for you to take the definitive step in the world of AI by helping you gain the knowledge and skills to level up your career. Along the way, you will also get career advice from deep learning experts from industry and academia.",
            "image": "https://course.oc-static.com/courses/6532316/6532316_teaser_picture_1614872115.jpg"
        },
        {
            "id": "103",
            "courseName": "Data Structure And Algorithm",
            "type": "Intermediate",
            "lessons": "24",
            "duration": "16 hours",
            "instructor": "Mark Queen",
            "category_id": "1",
            "skills": ["Play with 50 algorithmic puzzles on your smartphone to develop your algorithmic intuition!  Apply algorithmic techniques (greedy algorithms, binary search, dynamic programming, etc.) and data structures (stacks, queues, trees, graphs, etc.)", "Apply the newly learned algorithms to solve real-world challenges: navigating in a Big Network ", "Learn exactly the same material as undergraduate students in “Algorithms 101” at top universities and more!"],
            "description": "Computer science legend Donald Knuth once said “I don't understand things unless I try to program them.” We also believe that the best way to learn an algorithm is to program it. However, many excellent books and online courses on algorithms, that excel in introducing algorithmic ideas, have not yet succeeded in teaching you how to implement algorithms, the crucial computer science skill that you have to master at your next job interview. You will learn algorithms by implementing nearly 100 coding problems in a programming language of your choice. To the best of knowledge, no other online course in Algorithms comes close to offering you a wealth of programming challenges (and puzzles!) that you may face at your next job interview. We invested over 3000 hours into designing our challenges as an alternative to multiple choice questions that you usually find in MOOCs.",
            "image": "https://wallpapercave.com/wp/wp9165322.png"
        },
        {
            "id": "104",
            "courseName": "Competitive Programming",
            "type": "Advance",
            "lessons": "16",
            "duration": "12 hours",
            "instructor": "Susan Smoak",
            "category_id": "1",
            "skills":["It will take your programming skills to the next level.", "You will dominate the algorithms and data structures necessary to do well in contests.", "here are many tricks which are gained through experience and competitive programmers have a sixth sense when it comes to breaking problems down into the building blocks that make up a solution and which many are reluctant to share."],
            "description": "Learn to Prepare For Online Competitive Programming Contests Like ACM ICPC, Google CodeJam, Facebook HackerCup, and many more. Learn from highly rated and recognized competitive programmers on platforms like Codechef, LeetCode and CodeForces.",
            "image": "https://www.itfestusu.com/images/competition/competitive-programming.png"
        },
        {
            "id": "105",
            "courseName": "Introduction to Arduino",
            "type": "Beginner",
            "lessons": "15",
            "duration": "5 hours",
            "instructor": "Robert Frost",
            "category_id": "6",
            "skills": ["The basics of a arduino system.", "How to deploy a code model to a microcontroller.", "How to use machine to make decisions and predictions in an embedded system"],
            "description": "Introduction to Arduino. Arduino is an open source hardware and software platform for prototyping hardware solutions. This course will show you all you need to get going with Arduino and be able to build fun and interesting Arduino hardware solutions.",
            "image": "https://wallpaperaccess.com/full/5989966.jpg"
        },
        {
            "id": "106",
            "courseName": "Learn HTML",
            "type": "Beginner",
            "lessons": "12",
            "duration": "10 hours",
            "instructor": "Barry Allen",
            "category_id": "3",
            "skills": ["Structure pages with HTML.", "Present data with tables.", "Write cleaner HTML."],
            "description": "Fun fact: all websites use HTML — even this one. It's a fundamental part of every web developer's toolkit. HTML provides the content that gives web pages structure, by using elements and tags, you can add text, images, videos, forms, and more. Learning HTML basics is an important first step in your web development journey and an essential skill for front- and back-end developers.",
            "image": "https://wallpaperaccess.com/full/1631871.jpg"
        },
        {
            "id": "107",
            "courseName": "Intro to Figma",
            "type": "Beginner",
            "lessons": "10",
            "duration": "1 hour 40 minutes",
            "instructor": "Iris West",
            "category_id": "2",
            "skills": ["Design Websites","Design mobile and desktop apps", "You will have a fully interactive design and prototype at the end of this course.", "You will learn how to reuse design elements for future projects"],
            "description": "Want to get started in design, but don't know where to begin? These lessons and exercises will help you start designing immediately.",
            "image": "https://www.idigitalpreneur.com/assets/upload/course/166582267620221015UIUX_1920x1080_copy.jpeg"
        },
        {
            "id": "108",
            "courseName": "Information and Communication Technology",
            "type": "Beginner",
            "lessons": "15",
            "duration": "10 hours",
            "instructor": "Ralph Dibny",
            "category_id": "5",
            "skills": ["This is an introductory course on Information and Communication Technologies", "ICT terminologies", "Hardware and software components", "The internet and world wide web", "ICT based applications."],
            "description": "ICT (information and communications technology – or technologies) is an umbrella term that includes any communication device, medium, application, or technologies that provide access to information through telecommunications. This includes the Internet, Fibre Optic Networks, Fixed and Mobile Wireless networks, and other communication mediums. In the past few decades, information and communication technologies have provided society with a vast array of new communication capabilities. As such modern information and communication technologies have created a “global village,” in which people can communicate with others across the world as if they were living next door.",
            "image": "https://wallpaperaccess.com/full/1892752.jpg"
        }
    ]
}